Desktop.org
#+TITLE: Desktop
#+TODO: TODO(t) CHECK(s) | OFF(o)
#+PROPERTY: header-args                :mkdirp yes
#+PROPERTY: header-args:emacs-lisp     :eval never-export
#+PROPERTY: header-args:conf-space     :comments link
#+PROPERTY: header-args:js             :comments link
#+PROPERTY: header-args:conf-unix      :comments link
#+PROPERTY: header-args:conf-windows   :comments link
#+PROPERTY: header-args:conf-xdefaults :comments link
#+PROPERTY: header-args:sh             :tangle-mode (identity #o755) :comments link :shebang "#!/usr/bin/env bash"
#+PROPERTY: header-args:bash           :tangle-mode (identity #o755) :comments link :shebang "#!/usr/bin/env bash"
#+OPTIONS: broken-links:auto h:6 toc:nil

My general desktop environment configuration.

Parts prefixed with (OFF) are not used, but kept for historic purposes. For some reason GitHub's org renderer ignores TODO status, hence such a prefix. Round brackets instead of square ones to prevent GitHub's org renderer from screwing up.

References:
- [[https://sqrtminusone.xyz/posts/2022-02-12-literate/][A few cases of literate configuration]]. A few interesting ways in which literate configuration is used in this file.


* Some remarks
Removed features:
| Feature   | Last commit                              |
|-----------+------------------------------------------|
| rofi-buku | e22476b0cc6315e104e5ce4de5559a61c830c429 |

* Global customization
** Colors
I used to define color codes here (see [[https://github.com/SqrtMinusOne/dotfiles/commit/2dbf1cdd008ec0061456782cca3ebd76e603b31e][previous version of the file]]), now I just get colors from the current Emacs theme.

To use them, let's define a noweb block:
#+NAME: get-color
#+begin_src emacs-lisp :var name="black" quote=0
(let ((color (or (my/color-value name))))
  (if (> quote 0)
      (concat "\"" color "\"")
    color))
#+end_src

#+RESULTS: get-color
: #222222

Test:
#+begin_src emacs-lisp :noweb yes
<<get-color(name="red", quote=1)>>
#+end_src

#+RESULTS:
: #cc3333

Also, get a foreground for the current color:
#+NAME: get-fg-for-color
#+begin_src emacs-lisp :var name="black" quote=0
(let ((val (if (ct-light-p (my/color-value name))
               (my/color-value 'black)
             (my/color-value 'white))))
  (if (eq quote 1)
      (concat "\"" val "\"")
    val))
#+end_src

#+RESULTS: get-fg-for-color
: #fff8f0

Test;
#+begin_src emacs-lisp :noweb yes
<<get-fg-for-color(name="red", quote=1)>>
#+end_src

#+RESULTS:
: #fff8f0

This table used to have values, now it has only keys:
#+tblname: colors
| color         | key     |
|---------------+---------|
| black         | color0  |
| red           | color1  |
| green         | color2  |
| yellow        | color3  |
| blue          | color4  |
| magenta       | color5  |
| cyan          | color6  |
| white         | color7  |
| light-black   | color8  |
| light-red     | color9  |
| light-green   | color10 |
| light-yellow  | color11 |
| light-blue    | color12 |
| light-magenta | color13 |
| light-cyan    | color14 |
| light-white   | color15 |

** Xresources
*** Colors in Xresources
Some programs get their colors from =XResources=. Let's generate that file.

#+NAME: get-xresources
#+begin_src emacs-lisp :var table=colors
(mapconcat
 (lambda (elem)
   (concat "*" (nth 1 elem) ": " (my/color-value (nth 0 elem))))
 (seq-filter
  (lambda (elem) (and (nth 1 elem)
                      (not (string-empty-p (nth 1 elem)))))
  table)
 "\n")
#+end_src

#+RESULTS: get-xresources
#+begin_example
,*color0: #222222
,*color1: #cc3333
,*color2: #217a3c
,*color3: #8a5d00
,*color4: #375cd8
,*color5: #ba35af
,*color6: #1f6fbf
,*color7: #fff8f0
,*color8: #484848
,*color9: #ff8f88
,*color10: #8adf80
,*color11: #fac200
,*color12: #cbcfff
,*color13: #df8fff
,*color14: #88c8ff
,*color15: #ffffff
#+end_example

#+begin_src conf-xdefaults :noweb yes :tangle ~/.Xresources
<<get-xresources()>>

*background: <<get-color(name="bg")>>
*foreground: <<get-color(name="fg")>>
#+end_src

Run =xrdb -load ~/.Xresources= to apply the changes.
*** Fonts
Also, Xresources are used to set =Xft= settings. Unfortunately, the DPI setting has to be unique for each machine, which means I cannot commit =Xresources= to the repo.

#+NAME: get-dpi
#+begin_src emacs-lisp
(let ((hostname (system-name)))
  (cond ((string-equal hostname "azure") 120)
        ((string-equal hostname "eminence") 120)
        ((string-equal hostname "violet") 120)
        ((string-equal hostname "iris") 120)
        ((string-equal hostname "amaranth") 140)
        (t 96)))
#+end_src

#+begin_src conf-xdefaults :noweb yes :tangle ~/.Xresources
Xft.dpi: <<get-dpi()>>
#+end_src
** Themes
A few programs I use to customize the apperance are listed below.

| Guix dependency       | Description             |
|-----------------------+-------------------------|
| matcha-theme          | My preferred GTK theme  |
| papirus-icon-theme    | My preferred Icon theme |
| gnome-themes-standard |                         |
| xsettingsd            | X11 settings daemon     |
| gnome-themes-extra    |                         |

[[https://github.com/derat/xsettingsd][xsettingsd]] is a lightweight daemon which configures X11 applications. It is launched with shepherd in the [[*Services][Services]] section.

#+NAME: get-gtk-theme
#+begin_src emacs-lisp
(if (my/light-p)
    "Matcha-light-azul"
  "Matcha-dark-azul")
#+end_src

#+NAME: get-icons-theme
#+begin_src emacs-lisp
(if (my/light-p)
    "Papirus"
  "Papirus-Dark")
#+end_src

#+begin_src conf-space :tangle ~/.config/xsettingsd/xsettingsd.conf :noweb yes
Net/ThemeName "<<get-gtk-theme()>>"
Net/IconThemeName "<<get-icons-theme()>>"
Gtk/DecorationLayout "menu:minimize,maximize,close"
Gtk/FontName "Sans 10"
Gtk/MonospaceFontName "JetBrainsMono Nerd Mono 12"
Gtk/CursorThemeName "Adwaita"
Xft/Antialias 1
Xft/Hinting 0
Xft/HintStyle "hintnone"
#+end_src
** MIME
Setting the default MIME types
#+begin_src conf-unix :tangle ~/.config/mimeapps.list
[Default Applications]
text/html=qutebrowser.desktop
x-scheme-handler/http=firefox.desktop
x-scheme-handler/https=firefox.desktop
x-scheme-handler/tg=userapp-Telegram Desktop-7PVWF1.desktop
image/png=com.interversehq.qView.desktop
image/jpg=com.interversehq.qView.desktop
image/jpeg=com.interversehq.qView.desktop
application/pdf=org.pwmt.zathura.desktop

[Added Associations]
x-scheme-handler/tg=userapp-Telegram Desktop-7PVWF1.desktop;
application/pdf=org.pwmt.zathura.desktop
#+end_src
** Device-specific settings
| Guix dependency | Description                                |
|-----------------+--------------------------------------------|
| xrandr          | X11 CLI to RandR                           |
| xgamma          | A tool to alter monitor's gamma correction |
| xinput          | Configure input devices                    |

Set screen layout & other params depending on hostname
#+begin_src sh :tangle ~/bin/scripts/screen-layout
hostname=$(hostname)
if [ "$hostname" = "indigo" ]; then
    xrandr --output DisplayPort-0 --off --output HDMI-A-0 --mode 1920x1080 --pos 0x0 --rotate normal --output DVI-D-0 --mode 1920x1080 --pos 1920x0 --rotate normal
elif [ "$hostname" = "eminence" ]; then
    xgamma -gamma 1.25
elif [ "$hostname" = "violet" ]; then
    xrandr --output HDMI-0 --primary --mode 1920x1080 --pos 0x0 --rotate normal --output DP-0 --off --output DP-1 --mode 1920x1080 --pos 1920x0 --rotate normal --output DP-2 --off --output DP-3 --off --output DP-4 --off --output DP-5 --off --output None-1-1 --off
fi
#+end_src
* EXWM
:PROPERTIES:
:header-args+: :tangle ~/.emacs.d/desktop.el
:END:
Settings for [[https://github.com/ch11ng/exwm][Emacs X Window Manager]], a tiling WM implemented in Emacs Lisp. This part has a few bits copied from my blog post.

References:
- [[https://github.com/ch11ng/exwm/wiki][EXWM Wiki]]
- [[https://github.com/daviwil/emacs-from-scratch/blob/master/Desktop.org][Emacs From Scratch config]]
- [[https://sqrtminusone.xyz/posts/2022-01-03-exwm/][Using EXWM and perspective.el on a multi-monitor setup]]

** Startup & UI
*** Xsession
First things first, Emacs has to be launched as a window manager. On a more conventional system I'd create a .desktop file in some system folder that can be seen by a login manager, but in the case of Guix it's a bit more complicated, because all such folders are not meant to be changed manually.

| Category     | Guix dependency |
|--------------+-----------------|
| desktop-misc | xinit           |
| desktop-misc | xss-lock        |

However, GDM, the login manager that seems to be the default on Guix, launches =~/.xsession= on the startup if it's present, which is just fine for my purposes.

#+begin_src sh :tangle ~/.xsession
# Source .profile
. ~/.profile

# Disable access control for the current user
xhost +SI:localuser:$USER

# Fix for Java applications
export _JAVA_AWT_WM_NONREPARENTING=1

# Apply XResourses
xrdb -merge ~/.Xresources

# Turn off the system bell
xset -b

# Use i3lock as a screen locker
xss-lock -- i3lock -f -i /home/pavel/Pictures/lock-wallpaper.png &

# Some apps that have to be launched only once.
picom &
# nm-applet &
dunst &
copyq &

# Run the Emacs startup script as a session.
# exec dbus-launch --exit-with-session ~/.emacs.d/run-exwm.sh
exec dbus-launch --exit-with-session emacs -mm --debug-init -l ~/.emacs.d/desktop.el
#+end_src
*** Startup apps
Now that Emacs is launched, it is necessary to set up the EXWM-specific parts of config.

I want to launch some apps from EXWM instead of the Xsession file for two purposes:
- the app may need to have the entire desktop environment set up
- or it may need to be restarted if Emacs is killed.

As of now, these are polybar, feh and, shepherd:
#+begin_src emacs-lisp
(defun my/exwm-run-polybar ()
  (interactive)
  (call-process "~/bin/polybar.sh"))

(defun my/exwm-set-wallpaper ()
  (call-process-shell-command "feh --bg-fill ~/Pictures/wallpaper.jpg"))

(defun my/exwm-run-shepherd ()
  (when (string-empty-p (shell-command-to-string "pgrep -u pavel shepherd"))
    (call-process "shepherd")))
#+end_src
*** Pinentry
The GUI pinentry doesn't work too well with EXWM because of issues with popup windows, so we will use the Emacs one.

#+begin_src emacs-lisp
(use-package pinentry
  :straight t
  :after (exwm)
  :config
  (setenv "GPG_AGENT_INFO" nil) ;; use emacs pinentry
  (setq auth-source-debug t)

  (setq epg-gpg-program "gpg") ;; not necessary
  (require 'epa-file)
  (epa-file-enable)
  (setq epa-pinentry-mode 'loopback)
  (setq epg-pinentry-mode 'loopback)
  (pinentry-start))
#+end_src

#+NAME: find-pinentry
#+begin_src emacs-lisp :tangle no
(executable-find "pinentry")
#+end_src

#+RESULTS: find-pinentry
: /usr/bin/pinentry

#+begin_src conf-space :tangle ~/.gnupg/gpg-agent.conf :noweb yes
default-cache-ttl 3600
max-cache-ttl 3600
allow-emacs-pinentry
allow-loopback-pinentry
pinentry-program <<find-pinentry()>>
#+end_src
*** Modeline
Show the current workspace in the modeline.

#+begin_src emacs-lisp
(use-package exwm-modeline
  :straight t
  :config
  (add-hook 'exwm-init-hook #'exwm-modeline-mode)
  (my/use-colors
   (exwm-modeline-current-workspace
    :foreground (my/color-value 'yellow)
    :weight 'bold)))
#+end_src
*** Misc
Check if running Arch and not Guix.

#+begin_src emacs-lisp
(defun my/is-arch ()
  (file-exists-p "/etc/arch-release"))
#+end_src
** Windows
A bunch of functions related to managing windows in EXWM.

*** Moving windows
As I wrote in my [[https://sqrtminusone.xyz/posts/2021-10-04-emacs-i3/][Emacs and i3]] post, I want to have a rather specific behavior when moving windows (which does resemble i3 in some way):
- if there is space in the required direction, move the Emacs window there;
- if there is no space in the required direction, but space in two orthogonal directions, move the Emacs window so that there is no more space in the orthogonal directions;

I can't say it's better or worse than the built-in functionality or one provided by evil, but I'm used to it and I think it fits better for managing a lot of windows.

So, first, we need a predicate that checks whether there is space in the given direction:
#+begin_src emacs-lisp
(require 'windmove)

(defun my/exwm-direction-exists-p (dir)
  "Check if there is space in the direction DIR.

Does not take the minibuffer into account."
  (cl-some (lambda (dir)
             (let ((win (windmove-find-other-window dir)))
               (and win (not (window-minibuffer-p win)))))
           (pcase dir
             ('width '(left right))
             ('height '(up down)))))
#+end_src

And a function to implement that:
#+begin_src emacs-lisp
(defun my/exwm-move-window (dir)
  "Move the current window in the direction DIR."
  (let ((other-window (windmove-find-other-window dir))
        (other-direction (my/exwm-direction-exists-p
                          (pcase dir
                            ('up 'width)
                            ('down 'width)
                            ('left 'height)
                            ('right 'height)))))
    (cond
     ((and other-window (not (window-minibuffer-p other-window)))
      (window-swap-states (selected-window) other-window))
     (other-direction
      (evil-move-window dir)))))
#+end_src

My preferred keybindings for this part are, of course, =s-<H|J|K|L>=.
