Desktop.org
*** Colors
+The "colors" part is straightforward enough+. Once upon the time it was so...

Polybar can use =Xresources=, but the problem with that is you're supposed to use =colorX= as foreground, not as background. This usually works fine with dark themes from =doom-themes=, but not so much with high-contrast =modus-themes=.

So...
#+NAME: get-polybar-colors
#+begin_src emacs-lisp :var table=colors :tangle no
(mapconcat
 (lambda (elem)
   (format "%s = %s" (car elem) (cdr elem)))
 (append
  (nreverse
   (cl-reduce
    (lambda (acc name)
      (let* ((color (my/color-value name)))
        (unless (member name '("black"))
          (setq color (ct-iterate
                       color
                       (lambda (c) (ct-edit-hsl-l-inc c 2))
                       (lambda (c)
                         (ct-light-p c 65)))))
        (push (cons name color) acc)
        (push (cons (format "light-%s" name)
                    (ct-edit-lab-l-inc
                     color
                     my/alpha-for-light))
              acc)
        (push (cons (format "dark-%s" name)
                    (ct-edit-lab-l-dec
                     color
                     my/alpha-for-light))
              acc) )
      acc)
    '("black" "red" "green" "yellow" "blue" "magenta" "cyan" "white")
    :initial-value nil))
  `(("background" . ,(or (my/color-value 'bg-active)
                         (my/color-value 'bg)))
    ("foreground" . "#000000")))
 "\n")
#+end_src

#+RESULTS: get-polybar-colors
#+begin_example
black = #222222
light-black = #303030
dark-black = #131313
red = #e28b8b
light-red = #f69d9d
dark-red = #cd7879
green = #31ba54
light-green = #4acd65
dark-green = #09a642
yellow = #e49300
light-yellow = #faa522
dark-yellow = #ce8000
blue = #8f9fe3
light-blue = #a2b1f7
dark-blue = #7b8ccf
magenta = #db81cf
light-magenta = #ef93e2
dark-magenta = #c66ebb
cyan = #66a7e4
light-cyan = #7ab9f8
dark-cyan = #5094d0
white = #fff8f0
light-white = #fffef6
dark-white = #eae3dc
background = #c7c0ba
foreground = #000000
#+end_example

#+begin_src conf-windows :noweb yes
[colors]
<<get-polybar-colors()>>
#+end_src
*** Glyph settings
As for the module decorations though, I find it ironic that with all this fancy rendering around I have to resort to Unicode glyphs.

Anyhow, the approach is to put a glyph between two blocks like this:
#+begin_example
block1  block2
#+end_example

And set the foreground and background colors like that:
|            | block1 | glyph | block2  |
|------------+--------+-------+---------|
| foreground | F1     | B2    | F2      |
| background | B1     | B1    | B2      |

So, that's a start. First, let's define the glyph symbols in the polybar config:
#+begin_src conf-windows
[glyph]
gleft = 
gright = 
#+end_src
*** Defining modules
As we want to interweave polybar modules with these glyphs in the right order and with the right colors, it is reasonable to define a single source of truth:
#+NAME: polybar_modules
| Index | Module      | Color         | Glyph |
|-------+-------------+---------------+-------|
|     1 | pulseaudio  | light-magenta | +     |
|     2 | mpd         | magenta       | +     |
|    16 | nvidia      | light-cyan    | +     |
|    17 | backlight   | light-cyan    | +     |
|     3 | cpu         | cyan          | +     |
|    15 | temperature | cyan          | +     |
|     9 | battery     | cyan          | +     |
|     4 | ram-memory  | light-green   | +     |
|     5 | swap-memory | green         | +     |
|     6 | bandwidth   | light-red     | +     |
|     7 | openvpn     | light-red     |       |
|     8 | xkeyboard   | red           | +     |
|    10 | weather     | light-yellow  | +     |
|    12 | sun         | yellow        | +     |
|    13 | aw-afk      | light-blue    | +     |
|    14 | date        | blue          | +     |

Also excluding some modules from certain monitors, which for now is about excluding =battery= from the monitors of my desktop PC:

#+NAME: polybar_modules_exclude
| Monitor  | Hostname | Exclude     |
|----------+----------+-------------|
| HDMI-0   | violet   | battery     |
| HDMI-0   | violet   | backlight   |
| DP-1     | violet   | battery     |
| DP-1     | violet   | backlight   |
| HDMI-A-0 | eminence | battery     |
| HDMI-A-0 | eminence | nvidia      |
| eDP      | eminence | nvidia      |
| HDMI-1   | iris     | nvidia      |
| HDMI-1   | iris     | backlight   |
| DSI-1    | amaranth | nvidia      |
| DSI-1    | amaranth | mpd         |
| DSI-1    | amaranth | openvpn     |
| DSI-1    | amaranth | swap-memory |
| DSI-1    | amaranth | bandwidth   |
| DSI-1    | amaranth | temperature |
| DSI-1    | amaranth | weather     |
| DSI-1    | amaranth | sun         |

Another thing we need to do is to set the color of modules in accordance with the =polybar_modules= table. The background can be determined from the =Color= column with the following code block:
#+NAME: get-polybar-bg
#+begin_src emacs-lisp :var table=polybar_modules module="pulseaudio"
(format
 "${colors.%s}"
 (nth
  2
  (seq-find
   (lambda (el) (string-equal (nth 1 el) module))
   table)))
#+end_src

That block is meant to be invoked in each module definition.

*** Generating glyphs
To generate the required set of glyphs, we need a glyph for every possible combination of adjacent colors that can occur in polybar.

Most of these combinations can be inferred from the =polybar_modules= table, the rest are defined in another table:
#+NAME: polybar_extra_colors
| Color 1    | Color 2       |
|------------+---------------|
| background | white         |
| background | light-magenta |
| blue       | background    |

#+NAME: polybar-generate-glyphs
#+begin_src emacs-lisp :var table=polybar_modules exclude-table=polybar_modules_exclude extra=polybar_extra_colors
(let* ((monitor-hostnames
        (thread-last
          exclude-table
          (seq-map (lambda (el) (concat (nth 0 el) ":" (nth 1 el))))
          (seq-uniq)))
       (exclude-combinations
        (seq-uniq
         (seq-map
          (lambda (monitor-hostname)
            (let* ((split (string-split monitor-hostname ":"))
                   (monitor (nth 0 split))
                   (hostname (nth 1 split)))
              (seq-map
               (lambda (el) (nth 2 el))
               (seq-filter
                (lambda (el)
                  (and (string-equal (nth 0 el) monitor)
                       (string-equal (nth 1 el) hostname)
                       (nth 2 el)))
                exclude-table))))
          `(,@monitor-hostnames ""))))
       (module-glyph-combinations
        (thread-last
          exclude-combinations
          (seq-map
           (lambda (exclude)
             (thread-last
               table
               (seq-filter
                (lambda (elt)
                  (not (or
                        (member (nth 1 elt) exclude)
                        (not (string-equal (nth 3 elt) "+")))))))))
          (seq-uniq)))
       (color-changes nil))
  (dolist (e extra)
    (push (concat (nth 0 e) "--" (nth 1 e))
          color-changes))
  (dolist (comb module-glyph-combinations)
    (dotimes (i (1- (length comb)))
      (push
       (concat (nth 2 (nth i comb))
               "--"
               (nth 2 (nth (1+ i) comb)))
       color-changes)))
  (setq color-changes (seq-uniq color-changes))
  (mapconcat
   (lambda (el)
     (let ((colors (split-string el "--")))
       (format "
[module/glyph-%s--%s]
type = custom/text
content-background = ${colors.%s}
content-foreground = ${colors.%s}
content = ${glyph.gright}
content-font = 5"
               (nth 0 colors)
               (nth 1 colors)
               (nth 0 colors)
               (nth 1 colors))))
   color-changes
   "\n"))
#+end_src

Here's a rough outline of how the code works:
- =monitor-hostnames= is a list of unique monitor-hostname combination in =exclude-table=
- =exclude-combilnations= is a list of lists of module names to be excluded for each combinations
- =module-glyphs-combinations= is a list of lists of actual modules for each combination
- =color-changes= is a list of unique adjacent colors across modules in all combinations

Finally, =color-changes= is used to generate glyph modules that look like this:
#+begin_src conf-windows :tangle no
[module/glyph-light-cyan--cyan]
type = custom/text
content-background = ${colors.light-cyan}
content-foreground = ${colors.cyan}
content = ${glyph.gright}
content-font = 5
#+end_src

As of now, 15 of such modules is generated.

Include this to the polybar config itself:
#+begin_src conf-windows :noweb yes
<<polybar-generate-glyphs()>>
#+end_src
*** Generating set of modules
To configure polybar itself, we need to generate a set of modules for each monitor.

The parameters here, excluding the two required tables, are:
- =monitor= - the current monitor on which to filter out the blocks by the =polybar_modules_exclude= table,
- =first-color= - the first color of the first glyph,
- =last-color= - the second color of the last glyph.

#+NAME: polybar-generate-modules
#+begin_src emacs-lisp :var table=polybar_modules exclude-table=polybar_modules_exclude monitor="DSI-1" first-color="background" last-color="background" hostname="amaranth"
(let* ((exclude-modules
        (thread-last
          exclude-table
          (seq-filter (lambda (el) (and (string-equal (nth 0 el) monitor)
                                        (string-equal (nth 1 el) hostname))))
          (seq-map (lambda (el) (nth 2 el)))))
       (modules
        (thread-last
          table
          (seq-filter (lambda (el) (not (member (nth 1 el) exclude-modules))))))
       (prev-color first-color)
       (ret nil))
  (concat
   (mapconcat
    (lambda (el)
      (apply
       #'concat
       (list
        (when (string-equal (nth 3 el) "+")
          (setq ret (format "glyph-%s--%s " prev-color (nth 2 el)))
          (setq prev-color (nth 2 el))
          ret)
        (nth 1 el))))
    modules
    " ")
   (unless (string-empty-p last-color) (format " glyph-%s--%s " prev-color last-color))))
#+end_src

The polybar config doesn't support conditional statements, but it does support environment variables, so I pass the parameters from in the launch script.

*** Global bar config
Global bar configuration.

Monitor config and base colors.

#+begin_src conf-windows
[bar/mybar]
monitor = ${env:MONITOR:}
width = 100%
height = ${env:HEIGHT:27}
fixed-center = false
bottom = ${env:POLYBAR_BOTTOM:true}

background = ${colors.background}
foreground = ${colors.black}
#+end_src

Some geometry settings. These are set this way to make glyphs look the way they should

#+begin_src conf-windows
; line-size = 3
line-color = #f00

padding = 0

module-margin-left = 0
module-margin-right = 0
margin-bottom = 0
margin-top = 0

; underline-size = 0
border-size = 0

offset-x = 0
offset-y = 0
radius = 0.0
#+end_src

Fonts
#+begin_src conf-windows
; font-0 = ${env:FONT0:pango:monospace:size=10;1}
; font-1 = ${env:FONT1:NotoEmoji:scale=10:antialias=false;0}
; font-2 = ${env:FONT2:fontawesome:pixelsize=10;1}
; font-3 = ${env:FONT3:JetBrains Mono Nerd Font:monospace:size=10;1}

font-0 = pango:monospace:size=13;2
font-1 = NotoEmoji:scale=10:antialias=false;1
font-2 = fontawesome:pixelsize=13;3
font-3 = JetBrains Mono Nerd Font:monospace:size=13;4
font-4 = JetBrains Mono Nerd Font:monospace:size=17;4
#+end_src

Modules. Because I sometimes set up different blocks on different monitors, they are set via environment variables.
#+begin_src conf-windows
modules-left = i3 c-g glyph-left-light-background--blue
; modules-center = test
modules-right = ${env:RIGHT_BLOCKS}

tray-position = ${env:TRAY:right}
tray-padding = 0
tray-maxsize = 16
tray-background = ${colors.background}

wm-restack = i3
; override-redirect = true

scroll-up = i3wm-wsnext
scroll-down = i3wm-wsprev

; cursor-click = pointer
; cursor-scroll = ns-resize
#+end_src

DPI:
#+begin_src conf-windows
dpi-x = ${env:DPI}
dpi-y = ${env:DPI}
#+end_src

Misc settings.
#+begin_src conf-windows
[settings]
screenchange-reload = true
compositing-background = source
compositing-foreground = over
compositing-overline = over
compositing-underline = over
compositing-border = over

[global/wm]
margin-top = 0
margin-bottom = 0
#+end_src
*** Launch script
The script below allows me to:
- have different blocks on my two different-sized monitors and my laptop;
- have different settings on my desktop PC and laptop;

#+begin_src bash :tangle ./bin/polybar.sh :noweb yes
hostname=$(hostname)
# Settings varying on the hostname
DPI=96
BAR_HEIGHT=29

if [ "$hostname" = "azure" ]; then
    TRAY_MONITOR="eDP-1"
elif [ "$hostname" = "eminence" ]; then
    if xrandr --query | grep " connected" | cut -d" " -f1 | grep -q "HDMI-A-0"; then
        TRAY_MONITOR="HDMI-A-0"
    else
        TRAY_MONITOR="eDP"
    fi
elif [ "$hostname" = "iris" ]; then
    TRAY_MONITOR="HDMI-1"
elif [ "$hostname" = "amaranth" ]; then
    export BATTERY="axp20x-battery"
    export ADAPTER="axp22x-ac"
    TRAY_MONITOR="DSI-1"
else
    TRAY_MONITOR="DP-1"
fi

# Setting varying on the monitor
declare -A FONT_SIZE_OVERRIDE=(
    ["amaranth:DSI-1"]="13"
)
declare -A EMOJI_SCALE_OVERRIDE=(
    ["amaranth:DSI-1"]="13"
)
declare -A DPI_OVERRIDE=(
    ["amaranth:DSI-1"]="140"
)
declare -A BAR_HEIGHT_OVERRIDE=(
    ["amaranth:DSI-1"]="40"
)
declare -A BLOCKS=(
    ["violet:HDMI-0"]="<<polybar-generate-modules(monitor="HDMI-0" hostname="violet")>>"
    ["violet:DP-1"]="<<polybar-generate-modules(monitor="DP-1" hostname="violet")>>"
    ["eminence:eDP"]="<<polybar-generate-modules(monitor="HDMI-A-0" hostname="eminence")>>"
    ["eminence:HDMI-A-0"]="<<polybar-generate-modules(monitor="HDMI-A-0" hostname="eminence")>>"
    ["iris:HDMI-1"]="<<polybar-generate-modules(monitor="HDMI-1" hostname="iris")>>"
    ["amaranth:DSI-1"]="<<polybar-generate-modules(monitor="DSI-1" hostname="amaranth")>>"
)

declare -A TEMP_HWMON_PATHS=(
    ["eminence"]="/sys/devices/pci0000:00/0000:00:18.3/hwmon/hwmon2/temp1_input"
    ["indigo"]="/sys/devices/platform/coretemp.0/hwmon/hwmon2/temp1_input"
    ["violet"]="/sys/devices/platform/coretemp.0/hwmon/hwmon2/temp1_input"
    ["amaranth"]="/sys/devices/virtual/thermal/thermal_zone0/hwmon0/temp1_input"
)

declare -A BACKLIGHT_CARDS=(
    ["amaranth"]="backlight@0"
)

# Geolocation for some modules
export LOC="SPB"

# export IPSTACK_API_KEY=$(pass show My_Online/APIs/ipstack | head -n 1)

pkill polybar
for m in $(xrandr --query | grep " connected" | cut -d" " -f1); do
    export MONITOR=$m
    if [ "$MONITOR" = "$TRAY_MONITOR" ]; then
        export TRAY="right"
    else
        export TRAY="none"
    fi

    KEY="$(hostname):${m}"

    export HEIGHT=${BAR_HEIGHT_OVERRIDE[$KEY]:-$BAR_HEIGHT}
    export DPI=${DPI_OVERRIDE[$KEY]:-$DPI}
    export RIGHT_BLOCKS=${BLOCKS[$KEY]}
    if [[ -z "$RIGHT_BLOCKS" ]]; then
        continue
    fi

    export TEMP_HWMON_PATH=${TEMP_HWMON_PATHS[$(hostname)]}
    export BACKLIGHT_CARD=${BACKLIGHT_CARDS[$(hostname)]}

    polybar mybar &
done
#+end_src

** Individual modules
Some of the custom modules below use Org mode noweb to evaluate colors, because it's faster than querying =xrdb= at runtime. I wish I could reference polybar values there, but [[https://github.com/polybar/polybar/issues/615][it looks like this is impossible]].

If you want to copy something, you can go to the [[file:bin/polybar/][bin/polybar]] folder.

