Desktop.org
** Tridactyl
[[https://github.com/tridactyl/tridactyl][Tridactyl]] is a Firefox add-on that provides vim-like interface.

Run =:nativeinstall= at the first start.

*** Config
The native messenger allows to configure the addon with a config file.

#+begin_src conf :tangle ~/.tridactylrc
sanitize tridactyllocal tridactylsync

bind gn tabnew
bind gN tabclose

bind O fillcmdline tabopen

bind n findnext 1
bind N findnext -1
bind F hint -t

unbind <C-f>

set smoothscroll false
set findcase sensitive
colorscheme emacs

bind j scrollline 3
bind k scrollline -3
bind --mode=normal <C-i> mode ignore
bind --mode=ignore <C-i> mode normal

guiset_quiet gui full
guiset_quiet statuspanel left
guiset_quiet navbar none
guiset_quiet tabs always

set searchurls.g https://google.com/search?q=

set newtab about:blank

command fixamo_quiet jsb tri.excmds.setpref("privacy.resistFingerprinting.block_mozAddonManager", "true").then(tri.excmds.setpref("extensions.webextensions.restrictedDomains", '""'))
command fixamo js tri.excmds.setpref("privacy.resistFingerprinting.block_mozAddonManager", "true").then(tri.excmds.setpref("extensions.webextensions.restrictedDomains", '""').then(tri.excmds.fillcmdline_tmp(3000, "Permissions added to user.js. Please restart Firefox to make them take affect.")))
fixamo_quiet
#+end_src

*** Theme
Then, the package has its separate theme.

I based it on =base16-dracula= by [[http://chriskempson.com][Chris Kempson]], but replaced the colors with my Emacs theme.

#+begin_src css :tangle ~/themes/emacs.css :noweb yes
:root {
  --tridactyl-fg: <<get-color(name="fg")>>;
  --tridactyl-bg: <<get-color(name="bg")>>;
  --tridactyl-url-fg: <<get-color(name="red")>>;
  --tridactyl-url-bg: <<get-color(name="bg")>>;
  --tridactyl-highlight-box-bg: <<get-color(name="blue")>>;
  --tridactyl-highlight-box-fg: <<get-fg-for-color(name="blue")>>;

  /* Command line */
  --tridactyl-cmdl-bg: <<get-color(name="bg-alt")>>
  --tridactyl-cmdl-fg: <<get-color(name="fg")>>

  /* Hint character tags */
  --tridactyl-hintspan-fg: <<get-fg-for-color(name="blue")>> !important;
  --tridactyl-hintspan-bg: <<get-color(name="blue")>> !important;

  /* Element Highlights */
  --tridactyl-hint-active-fg: none;
  --tridactyl-hint-active-bg: none;
  --tridactyl-hint-active-outline: none;
  /* --tridactyl-hint-activy-outline: var(--base08); */
  --tridactyl-hint-bg: none;
  --tridactyl-hint-outline: none;
  /* --tridactyl-hint-outline: var(--base08); */
}

/* a { */
/*   color: var(--base04); */
/* } */

#command-line-holder {
  order: 1;
  border: 2px solid <<get-color(name="blue")>>;
  background: <<get-color(name="bg")>>;
}

#tridactyl-input {
  padding: 1rem;
  color: var(--tridactyl-fg);
  width: 90%;
  font-size: 1.2rem;
  line-height: 1.5;
  background: var(--tridactyl-bg);
  padding-left: unset;
  padding: 1rem;
}

#completions table {
  font-size: 0.8rem;
  font-weight: 200;
  border-spacing: 0;
  table-layout: fixed;
  padding: 1rem;
  padding-top: 1rem;
  padding-bottom: 1rem;
}

#completions > div {
  max-height: calc(20 * var(--option-height));
  min-height: calc(10 * var(--option-height));
}

/* COMPLETIONS */

#completions {
  --option-height: 1.4em;
  color: var(--tridactyl-fg);
  background: var(--tridactyl-bg);
  display: inline-block;
  font-size: unset;
  font-weight: 200;
  overflow: hidden;
  width: 100%;
  border-top: unset;
  order: 2;
}

/* Olie doesn't know how CSS inheritance works */
#completions .HistoryCompletionSource {
  max-height: unset;
  min-height: unset;
}

#completions .HistoryCompletionSource table {
  width: 100%;
  font-size: 11pt;
  border-spacing: 0;
  table-layout: fixed;
}

/* redundancy 2: redundancy 2: more redundancy */
#completions .BmarkCompletionSource {
  max-height: unset;
  min-height: unset;
}

#completions table tr td.prefix,#completions table tr td.privatewindow,#completions table tr td.container,#completions table tr td.icon {
  display: none;
}

#completions .BufferCompletionSource table {
  width: unset;
  font-size: unset;
  border-spacing: unset;
  table-layout: unset;
}

#completions table tr .title {
  width: 50%;
}

#completions table tr {
  white-space: nowrap;
  overflow: hidden;
  text-overflow: ellipsis;
}

#completions .sectionHeader {
  background: unset;
  font-weight: 200;
  border-bottom: unset;
  padding: 1rem !important;
  padding-left: unset;
  padding-bottom: 0.2rem;
}

#cmdline_iframe {
  position: fixed !important;
  bottom: unset;
  top: 25% !important;
  left: 10% !important;
  z-index: 2147483647 !important;
  width: 80% !important;
  box-shadow: rgba(0, 0, 0, 0.5) 0px 0px 20px !important;
}

.TridactylStatusIndicator {
  position: fixed !important;
  bottom: 0 !important;
  background: var(--tridactyl-bg) !important;
  border: unset !important;
  border: 1px <<get-color(name="blue")>> solid !important;
  font-size: 12pt !important;
  /*font-weight: 200 !important;*/
  padding: 0.8ex !important;
}

#completions .focused {
  background: <<get-color(name="blue")>>;
  color: <<get-fg-for-color(name="blue")>>;
}

#completions .focused .url {
  background: <<get-color(name="blue")>>;
  color: <<get-fg-for-color(name="blue")>>;
}
/* #Ocean-normal { */
/*  border-color: green !important; */
/* } */

/* #Ocean-insert { */
/*  border-color: yellow !important; */
/* } */
#+end_src
** Firefox Color
[[https://color.firefox.com/][Firefox Color]] is a system that allows for easy experimentation with Firefox themes.

It can serialize themes into URLs like =https://color.firefox.com/?theme=<theme>=, so I thought it would be a piece of cake to generate one from my Emacs theme, right? Well...

As it turns out, Firefox uses npm package called [[https://github.com/masotime/json-url][json-url]] to create =<theme>=, which this package does by the following sequence:
- msgpack v5
- lzma
- url-safe base64
I tried to reproduce the above in Emacs, but in the end gave up and used the package in a simple node script:

#+begin_src js :tangle ~/bin/firefox-theme/main.js
const JsonUrl = require('json-url');
const jsonCodec = JsonUrl('lzma');

const json = JSON.parse(process.argv[2]);
jsonCodec.compress(json).then((r) => process.stdout.write(r));
#+end_src

Which I then can use to create the URL.

#+begin_src emacs-lisp
(defun my/firefox-encode-json (string)
  (with-output-to-string
    (with-current-buffer standard-output
      (call-process "node" nil t nil
                    (expand-file-name "~/bin/firefox-theme/main.js")
                    string))))

(defun my/color-value-rgb (color)
  (let ((color (if (stringp color)
                   color
                 (my/color-value color))))
    `((r . ,(* 2.55 (ct-get-rgb-r color)))
      (g . ,(* 2.55 (ct-get-rgb-g color)))
      (b . ,(* 2.55 (ct-get-rgb-b color))))))

(defun my/firefox-get-json ()
  (let ((toolbar-color
         (my/color-value-rgb
          'modeline))
        (text-color
         (my/color-value-rgb
          (if (my/light-p) 'fg 'yellow))))
    `((colors . ((toolbar . ,toolbar-color)
                 (toolbar_text . ,text-color)
                 (frame . ,(my/color-value-rgb 'bg))
                 (tab_background_text . ,(my/color-value-rgb 'fg))
                 (toolbar_field . ,(my/color-value-rgb 'bg))
                 (toolbar_field_text . ,(my/color-value-rgb 'blue))
                 (tab_line . ,text-color)
                 (popup . ,(my/color-value-rgb 'bg-alt))
                 (popup_text . ,(my/color-value-rgb 'fg))
                 (tab_loading . ,text-color))))))

(defun my/firefox-get-color-url ()
  (concat
   "https://color.firefox.com/?theme="
   (my/firefox-encode-json
    (json-encode
     (my/firefox-get-json)))))

(defun my/firefox-kill-color-url ()
  (interactive)
  (kill-new (my/firefox-get-color-url)))

(my/firefox-get-color-url)
#+end_src

#+RESULTS:
: https://color.firefox.com/?theme=XQAAAAJFAQAAAAAAAABAqYhm849SCia3ftKEGccwS-xMDPsqcRvjh8JMhYPDf9_kNjVRdqrKsHr5AamG1FlOJ8DH_BqRXLhVF02YoR2FXVUIEYoXiV-3q19EVo-NqESyeWWEIwj-0QxR3X-JxWYJLJYc6tAeNGGDXNNrM0pNWpwesvR43yXL_fJfr9Q919y2QwP0cK7ZXO1lRou4HkpwWW4LWdO3V6ox_BN9yA

* keynav
| Guix dependency |
|-----------------|
| keynav          |

| Type    | Note                           |
|---------+--------------------------------|
| SYMLINK | ./config/keynavrc -> .keynavrc |

[[https://github.com/jordansissel/keynav][keynav]] is a program for controlling mouse with keyboard, mostly by screen bisection. This is a poor replacement for a proper keyboard-drived sofware, but...

References:
- [[https://github.com/jordansissel/keynav/blob/master/keynav.pod][keynav documentation]]
** Config
#+begin_src conf-space :tangle ./.config/keynav/keynavrc
# clear all previous keybindings
clear

# Start & stop
ctrl+semicolon start
Super_L+bracketright start
Super_R+bracketright start
Escape end
ctrl+bracketleft end

# Macros
q record ~/.keynav_macros
shift+at playback

# Bisecting
a history-back
Left cut-left
Right cut-right
Down cut-down
Up cut-up
h cut-left
j cut-down
k cut-up
l cut-right
t windowzoom                          # Zoom to the current window
c cursorzoom 300 300                  # Limit the bisection area by 300x300

# Move the bisecting area
shift+h move-left
shift+j move-down
shift+k move-up
shift+l move-right
shift+Left move-left
shift+Right move-right
shift+Up move-up
shift+Down move-down

# Actions
space warp,click 3,end                # Right click
Return warp,click 1,end               # Left click
Shift+Return warp,doubleclick 1,end   # Double left click
semicolon warp,end                    # Move the cursor and exit
w warp                                # Just move the cursor
e end                                 # exit
u warp,click 4                        # scroll up
d warp,click 5                        # scroll down
1 click 1
2 click 2
3 click 3
4 click 4
5 click 5
#+end_src
** Using with picom
I've noticed that the program does not play nice with picom's fade effect. To fix that, add the following to you config:
#+begin_src conf-unix :tangle no
fade-exclude = [
  "class_i = 'keynav'",
  "class_g = 'keynav'",
]
#+end_src
* Picom
:PROPERTIES:
:header-args+: :tangle ./.config/picom.conf
:END:

| Guix dependency |
|-----------------|
| picom           |

[[https://github.com/yshui/picom][picom]] is a compositor for X11. It allows effects such as transparency, blurring, etc.

Check out the sample configuration to get an idea on what's possible. I only have some basic settings in mine.

Also, there are some fancy forks of picom (e.g. [[https://github.com/ibhagwan/picom][ibhagwan/picom]] adds rounded corners).

References:
- [[https://github.com/yshui/picom/wiki][picom wiki]]
- [[https://wiki.archlinux.org/index.php/Picom][Picom on ArchWiki]]
- [[https://github.com/yshui/picom/blob/next/picom.sample.conf][Sample configuration]]

** Shadows
#+begin_src conf-unix
shadow = true;
shadow-radius = 2;
shadow-offset-x = -2;
shadow-offset-y = -2;

shadow-exclude = [
  "name = 'Notification'",
  "class_g = 'Conky'",
  "name ?= 'cpt_frame_window'",
  "class_g ?= 'Notify-osd'",
  "class_g = 'Cairo-clock'",
  "_GTK_FRAME_EXTENTS@:c"
];
#+end_src
** Fading
#+begin_src conf-unix
fading = true

fade-in-step = 0.03;
fade-out-step = 0.03;
fade-delta = 10

fade-exclude = [
  "class_i = 'keynav'",
  "class_g = 'keynav'",
  "class_i = 'emacs'",
  "class_g = 'emacs'",
]
#+end_src
** Opacity
I don't use stuff like transparency for inactive windows.

The first 5 lines of =opacity-rule= make i3wm's hidden windows 100% transparent, so I see the background behind the semi-transparent windows in i3wm's stacked and tabbed layout. Here is [[https://unix.stackexchange.com/questions/281131/compton-i3-tabbed-stacked-transparency-background-image][StackExchange question]] about that.

I also noticed that for some reason it doesn't play well with Emacs's built-in transparency, so the last line sets up Emacs transparency at 90%.

#+begin_src conf-unix
inactive-opacity = 1;

frame-opacity = 1.0;
inactive-opacity-override = false;
focus-exclude = [ "class_g = 'Cairo-clock'" ];

opacity-rule = [
  "0:_NET_WM_STATE@[0]:32a = '_NET_WM_STATE_HIDDEN'",
  "0:_NET_WM_STATE@[1]:32a = '_NET_WM_STATE_HIDDEN'",
  "0:_NET_WM_STATE@[2]:32a = '_NET_WM_STATE_HIDDEN'",
  "0:_NET_WM_STATE@[3]:32a = '_NET_WM_STATE_HIDDEN'",
  "0:_NET_WM_STATE@[4]:32a = '_NET_WM_STATE_HIDDEN'",
  "90:class_g = 'Emacs'"
];
#+end_src
** General settings
Default general settings. Editing some of these may be neeeded in case of performance issues.

#+begin_src conf-unix
backend = "xrender";
vsync = true
mark-wmwin-focused = true;
mark-ovredir-focused = true;
detect-rounded-corners = true;
detect-client-opacity = true;
refresh-rate = 0
detect-transient = true
detect-client-leader = true
use-damage = true
log-level = "warn";

wintypes:
{
  tooltip = { fade = true; shadow = true; opacity = 0.75; focus = true; full-shadow = false; };
  dock = { shadow = false; }
  dnd = { shadow = false; }
  popup_menu = { opacity = 1; }
  dropdown_menu = { opacity = 1; }
};
#+end_src
